; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.flow = type { i32, i32, i16, i16, i8 }
%struct.info_map = type { i32, i64 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@xdp_flow_map = dso_local global %struct.bpf_map_def { i32 1, i32 16, i32 16, i32 15000, i32 0 }, section "maps", align 4, !dbg !52
@xdp_blocked_flows = dso_local global %struct.bpf_map_def { i32 1, i32 16, i32 4, i32 15000, i32 0 }, section "maps", align 4, !dbg !62
@__const.xdp_pass_func.____fmt = private unnamed_addr constant [25 x i8] c"Looking up eBPF element\0A\00", align 1
@__const.xdp_pass_func.____fmt.1 = private unnamed_addr constant [59 x i8] c"This flow is in the black list, so the program will abort\0A\00", align 1
@__const.xdp_pass_func.____fmt.2 = private unnamed_addr constant [44 x i8] c"Writing in the new element of the eBPF map\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !94, line: 16, type: !54, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !51, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "fdf3cf4b326a2fd61a580ee2098bb75f")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "headers/linux/bpf.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9a7f04155c254fef1b7ada5eb82c984c")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !49, line: 24, baseType: !50)
!49 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !{!0, !52, !62, !64, !70, !80, !87}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "xdp_flow_map", scope: !2, file: !3, line: 19, type: !54, isLocal: false, isDefinition: true)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !55, line: 33, size: 160, elements: !56)
!55 = !DIFile(filename: "libbpf/src/build/usr/include/bpf/bpf_helpers.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !55, line: 34, baseType: !7, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !54, file: !55, line: 35, baseType: !7, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !54, file: !55, line: 36, baseType: !7, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !54, file: !55, line: 37, baseType: !7, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !54, file: !55, line: 38, baseType: !7, size: 32, offset: 128)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "xdp_blocked_flows", scope: !2, file: !3, line: 26, type: !54, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 115, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, elements: !68)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !72, line: 152, type: !73, isLocal: true, isDefinition: true)
!72 = !DIFile(filename: "libbpf/src/build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !77, !79, null}
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !49, line: 27, baseType: !7)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !72, line: 33, type: !82, isLocal: true, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!46, !46, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !72, line: 55, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!76, !46, !85, !85, !92}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !49, line: 31, baseType: !93)
!93 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIFile(filename: "././common/xdp_stats_kern.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "0f65d57b07088eec24d5031993b90668")
!95 = !{i32 7, !"Dwarf Version", i32 5}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 4}
!98 = !{i32 7, !"frame-pointer", i32 2}
!99 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!100 = distinct !DISubprogram(name: "xdp_pass_func", scope: !3, file: !3, line: 35, type: !101, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !111)
!101 = !DISubroutineType(types: !102)
!102 = !{!76, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !6, line: 2857, baseType: !79, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !104, file: !6, line: 2858, baseType: !79, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !104, file: !6, line: 2859, baseType: !79, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !104, file: !6, line: 2861, baseType: !79, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !104, file: !6, line: 2862, baseType: !79, size: 32, offset: 128)
!111 = !{!112, !113, !114, !115, !116, !130, !149, !158, !180, !181, !182, !187, !188, !189, !198, !203, !205, !212, !213, !219, !226, !227}
!112 = !DILocalVariable(name: "ctx", arg: 1, scope: !100, file: !3, line: 35, type: !103)
!113 = !DILocalVariable(name: "action", scope: !100, file: !3, line: 36, type: !79)
!114 = !DILocalVariable(name: "eth_type", scope: !100, file: !3, line: 37, type: !76)
!115 = !DILocalVariable(name: "ip_type", scope: !100, file: !3, line: 37, type: !76)
!116 = !DILocalVariable(name: "eth", scope: !100, file: !3, line: 38, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !119, line: 168, size: 112, elements: !120)
!119 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!120 = !{!121, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !118, file: !119, line: 169, baseType: !122, size: 48)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !124)
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !{!125}
!125 = !DISubrange(count: 6)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !118, file: !119, line: 170, baseType: !122, size: 48, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !118, file: !119, line: 171, baseType: !128, size: 16, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !129, line: 25, baseType: !48)
!129 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!130 = !DILocalVariable(name: "iphdr", scope: !100, file: !3, line: 39, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !133, line: 86, size: 160, elements: !134)
!133 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "8776158f5e307e9a8189f0dae4b43df4")
!134 = !{!135, !137, !138, !139, !140, !141, !142, !143, !144, !146, !148}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !132, file: !133, line: 88, baseType: !136, size: 4, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !49, line: 21, baseType: !123)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !132, file: !133, line: 89, baseType: !136, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !132, file: !133, line: 96, baseType: !136, size: 8, offset: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !132, file: !133, line: 97, baseType: !128, size: 16, offset: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !133, line: 98, baseType: !128, size: 16, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !132, file: !133, line: 99, baseType: !128, size: 16, offset: 48)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !132, file: !133, line: 100, baseType: !136, size: 8, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !132, file: !133, line: 101, baseType: !136, size: 8, offset: 72)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !132, file: !133, line: 102, baseType: !145, size: 16, offset: 80)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !129, line: 31, baseType: !48)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !132, file: !133, line: 103, baseType: !147, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !129, line: 27, baseType: !79)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !132, file: !133, line: 104, baseType: !147, size: 32, offset: 128)
!149 = !DILocalVariable(name: "udphdr", scope: !100, file: !3, line: 40, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !152, line: 23, size: 64, elements: !153)
!152 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !151, file: !152, line: 24, baseType: !128, size: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !151, file: !152, line: 25, baseType: !128, size: 16, offset: 16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !152, line: 26, baseType: !128, size: 16, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !151, file: !152, line: 27, baseType: !145, size: 16, offset: 48)
!158 = !DILocalVariable(name: "tcphdr", scope: !100, file: !3, line: 41, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !161, line: 25, size: 160, elements: !162)
!161 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !160, file: !161, line: 26, baseType: !128, size: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !160, file: !161, line: 27, baseType: !128, size: 16, offset: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !160, file: !161, line: 28, baseType: !147, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !160, file: !161, line: 29, baseType: !147, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !160, file: !161, line: 31, baseType: !48, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !160, file: !161, line: 32, baseType: !48, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !160, file: !161, line: 33, baseType: !48, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !160, file: !161, line: 34, baseType: !48, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !160, file: !161, line: 35, baseType: !48, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !160, file: !161, line: 36, baseType: !48, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !160, file: !161, line: 37, baseType: !48, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !160, file: !161, line: 38, baseType: !48, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !160, file: !161, line: 39, baseType: !48, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !160, file: !161, line: 40, baseType: !48, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !160, file: !161, line: 55, baseType: !128, size: 16, offset: 112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !160, file: !161, line: 56, baseType: !145, size: 16, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !160, file: !161, line: 57, baseType: !128, size: 16, offset: 144)
!180 = !DILocalVariable(name: "data_end", scope: !100, file: !3, line: 42, type: !46)
!181 = !DILocalVariable(name: "data", scope: !100, file: !3, line: 43, type: !46)
!182 = !DILocalVariable(name: "nh", scope: !100, file: !3, line: 44, type: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !184, line: 33, size: 64, elements: !185)
!184 = !DIFile(filename: "././common/parsing_helpers.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !183, file: !184, line: 34, baseType: !46, size: 64)
!187 = !DILocalVariable(name: "sport", scope: !100, file: !3, line: 58, type: !128)
!188 = !DILocalVariable(name: "dport", scope: !100, file: !3, line: 58, type: !128)
!189 = !DILocalVariable(name: "curr_flow", scope: !100, file: !3, line: 79, type: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow", file: !191, line: 5, size: 128, elements: !192)
!191 = !DIFile(filename: "./common_kern_user_datastructure.h", directory: "/home/albert/TMA_github/eBPF_code", checksumkind: CSK_MD5, checksum: "e409766daf32dd06fbb76622c50dab89")
!192 = !{!193, !194, !195, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !190, file: !191, line: 6, baseType: !147, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !190, file: !191, line: 7, baseType: !147, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !190, file: !191, line: 8, baseType: !128, size: 16, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !190, file: !191, line: 9, baseType: !128, size: 16, offset: 80)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !190, file: !191, line: 10, baseType: !136, size: 8, offset: 96)
!198 = !DILocalVariable(name: "____fmt", scope: !199, file: !3, line: 87, type: !200)
!199 = distinct !DILexicalBlock(scope: !100, file: !3, line: 87, column: 2)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 200, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 25)
!203 = !DILocalVariable(name: "blocked", scope: !100, file: !3, line: 89, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!205 = !DILocalVariable(name: "____fmt", scope: !206, file: !3, line: 91, type: !209)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 91, column: 3)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 90, column: 32)
!208 = distinct !DILexicalBlock(scope: !100, file: !3, line: 90, column: 6)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 472, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 59)
!212 = !DILocalVariable(name: "pack_length", scope: !100, file: !3, line: 95, type: !92)
!213 = !DILocalVariable(name: "data_map", scope: !100, file: !3, line: 96, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info_map", file: !191, line: 13, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "packets", scope: !215, file: !191, line: 14, baseType: !79, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !215, file: !191, line: 15, baseType: !92, size: 64, offset: 64)
!219 = !DILocalVariable(name: "____fmt", scope: !220, file: !3, line: 99, type: !223)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 99, column: 3)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 98, column: 24)
!222 = distinct !DILexicalBlock(scope: !100, file: !3, line: 98, column: 6)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 352, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 44)
!226 = !DILocalVariable(name: "new_data", scope: !221, file: !3, line: 100, type: !215)
!227 = !DILabel(scope: !100, name: "out", file: !3, line: 111)
!228 = !DILocation(line: 0, scope: !100)
!229 = !DILocation(line: 42, column: 38, scope: !100)
!230 = !{!231, !232, i64 4}
!231 = !{!"xdp_md", !232, i64 0, !232, i64 4, !232, i64 8, !232, i64 12, !232, i64 16}
!232 = !{!"int", !233, i64 0}
!233 = !{!"omnipotent char", !234, i64 0}
!234 = !{!"Simple C/C++ TBAA"}
!235 = !DILocation(line: 42, column: 27, scope: !100)
!236 = !DILocation(line: 42, column: 19, scope: !100)
!237 = !DILocation(line: 43, column: 34, scope: !100)
!238 = !{!231, !232, i64 0}
!239 = !DILocation(line: 43, column: 23, scope: !100)
!240 = !DILocation(line: 43, column: 15, scope: !100)
!241 = !DILocalVariable(name: "nh", arg: 1, scope: !242, file: !184, line: 124, type: !245)
!242 = distinct !DISubprogram(name: "parse_ethhdr", scope: !184, file: !184, line: 124, type: !243, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !247)
!243 = !DISubroutineType(types: !244)
!244 = !{!76, !245, !46, !246}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!247 = !{!241, !248, !249}
!248 = !DILocalVariable(name: "data_end", arg: 2, scope: !242, file: !184, line: 125, type: !46)
!249 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !242, file: !184, line: 126, type: !246)
!250 = !DILocation(line: 0, scope: !242, inlinedAt: !251)
!251 = distinct !DILocation(line: 46, column: 13, scope: !100)
!252 = !DILocalVariable(name: "nh", arg: 1, scope: !253, file: !184, line: 79, type: !245)
!253 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !184, file: !184, line: 79, type: !254, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !263)
!254 = !DISubroutineType(types: !255)
!255 = !{!76, !245, !46, !246, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !184, line: 64, size: 32, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !257, file: !184, line: 65, baseType: !260, size: 32)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !{!252, !264, !265, !266, !267, !268, !269, !275, !276}
!264 = !DILocalVariable(name: "data_end", arg: 2, scope: !253, file: !184, line: 80, type: !46)
!265 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !253, file: !184, line: 81, type: !246)
!266 = !DILocalVariable(name: "vlans", arg: 4, scope: !253, file: !184, line: 82, type: !256)
!267 = !DILocalVariable(name: "eth", scope: !253, file: !184, line: 84, type: !117)
!268 = !DILocalVariable(name: "hdrsize", scope: !253, file: !184, line: 85, type: !76)
!269 = !DILocalVariable(name: "vlh", scope: !253, file: !184, line: 86, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !184, line: 42, size: 32, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !271, file: !184, line: 43, baseType: !128, size: 16)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !271, file: !184, line: 44, baseType: !128, size: 16, offset: 16)
!275 = !DILocalVariable(name: "h_proto", scope: !253, file: !184, line: 87, type: !48)
!276 = !DILocalVariable(name: "i", scope: !253, file: !184, line: 88, type: !76)
!277 = !DILocation(line: 0, scope: !253, inlinedAt: !278)
!278 = distinct !DILocation(line: 129, column: 9, scope: !242, inlinedAt: !251)
!279 = !DILocation(line: 93, column: 14, scope: !280, inlinedAt: !278)
!280 = distinct !DILexicalBlock(scope: !253, file: !184, line: 93, column: 6)
!281 = !DILocation(line: 93, column: 24, scope: !280, inlinedAt: !278)
!282 = !DILocation(line: 93, column: 6, scope: !253, inlinedAt: !278)
!283 = !DILocation(line: 99, column: 17, scope: !253, inlinedAt: !278)
!284 = !{!285, !285, i64 0}
!285 = !{!"short", !233, i64 0}
!286 = !DILocalVariable(name: "h_proto", arg: 1, scope: !287, file: !184, line: 68, type: !48)
!287 = distinct !DISubprogram(name: "proto_is_vlan", scope: !184, file: !184, line: 68, type: !288, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{!76, !48}
!290 = !{!286}
!291 = !DILocation(line: 0, scope: !287, inlinedAt: !292)
!292 = distinct !DILocation(line: 106, column: 8, scope: !293, inlinedAt: !278)
!293 = distinct !DILexicalBlock(scope: !294, file: !184, line: 106, column: 7)
!294 = distinct !DILexicalBlock(scope: !295, file: !184, line: 105, column: 39)
!295 = distinct !DILexicalBlock(scope: !296, file: !184, line: 105, column: 2)
!296 = distinct !DILexicalBlock(scope: !253, file: !184, line: 105, column: 2)
!297 = !DILocation(line: 70, column: 20, scope: !287, inlinedAt: !292)
!298 = !DILocation(line: 70, column: 46, scope: !287, inlinedAt: !292)
!299 = !DILocation(line: 106, column: 8, scope: !293, inlinedAt: !278)
!300 = !DILocation(line: 106, column: 7, scope: !294, inlinedAt: !278)
!301 = !DILocation(line: 112, column: 18, scope: !294, inlinedAt: !278)
!302 = !DILocation(line: 52, column: 15, scope: !303)
!303 = distinct !DILexicalBlock(scope: !100, file: !3, line: 52, column: 6)
!304 = !DILocation(line: 52, column: 6, scope: !100)
!305 = !DILocalVariable(name: "nh", arg: 1, scope: !306, file: !184, line: 151, type: !245)
!306 = distinct !DISubprogram(name: "parse_iphdr", scope: !184, file: !184, line: 151, type: !307, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !310)
!307 = !DISubroutineType(types: !308)
!308 = !{!76, !245, !46, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!310 = !{!305, !311, !312, !313, !314}
!311 = !DILocalVariable(name: "data_end", arg: 2, scope: !306, file: !184, line: 152, type: !46)
!312 = !DILocalVariable(name: "iphdr", arg: 3, scope: !306, file: !184, line: 153, type: !309)
!313 = !DILocalVariable(name: "iph", scope: !306, file: !184, line: 155, type: !131)
!314 = !DILocalVariable(name: "hdrsize", scope: !306, file: !184, line: 156, type: !76)
!315 = !DILocation(line: 0, scope: !306, inlinedAt: !316)
!316 = distinct !DILocation(line: 53, column: 13, scope: !317)
!317 = distinct !DILexicalBlock(scope: !303, file: !3, line: 52, column: 39)
!318 = !DILocation(line: 161, column: 17, scope: !306, inlinedAt: !316)
!319 = !DILocation(line: 161, column: 21, scope: !306, inlinedAt: !316)
!320 = !DILocation(line: 163, column: 13, scope: !321, inlinedAt: !316)
!321 = distinct !DILexicalBlock(scope: !306, file: !184, line: 163, column: 5)
!322 = !DILocation(line: 163, column: 5, scope: !306, inlinedAt: !316)
!323 = !DILocation(line: 167, column: 14, scope: !324, inlinedAt: !316)
!324 = distinct !DILexicalBlock(scope: !306, file: !184, line: 167, column: 6)
!325 = !DILocation(line: 167, column: 24, scope: !324, inlinedAt: !316)
